In [249]:
import numpy as np
import pandas as pd

In [250]:
iterables = [["bar", "baz", "foo", "qux"], ["one", "two"]]

In [251]:
df = pd.DataFrame(
    np.random.randint(1000000, size=(8, 4)), 
    index=pd.MultiIndex.from_product(iterables),
    columns=['Total Imponible', 'Cotización Voluntaria (APVI) asdsadasdasd', 'Total A Pagar A AFP', 'Total A Pagar SC']
)

In [252]:
df

         Total Imponible  Cotización Voluntaria (APVI) asdsadasdasd  \
bar one           809219                                     549943
    two           815015                                      50900
baz one           337284                                     774802
    two           882148                                      80603
foo one           553820                                     387206
    two           978074                                     661484
qux one           436596                                     500549
    two           395341                                     763924

         Total A Pagar A AFP  Total A Pagar SC
bar one               650968            570665
    two               689164            849354
baz one               333735            551373
    two               547112            155913
foo one               349719            173578
    two               911056            165162
qux one               810898            512850
    two               533588            701000

Create pandas writer:

Convert the dataframe to an XlsxWriter Excel object:

In [253]:
df.to_excel(writer, sheet_name='Sheet1')

Get the xlsxwriter workbook and worksheet objects:

In [254]:
workbook  = writer.book
worksheet = writer.sheets['Sheet1']

Add some cell formats:

In [255]:
num_format = workbook.add_format({'num_format': '# ##0'})
wrap_format = workbook.add_format({'text_wrap': True})

Set the column width and format:

In [256]:
worksheet.set_column('C:F', 20, num_format)

0

In [257]:
worksheet.set_row(0, 20, wrap_format)

Set the format but not the column width:

In [258]:
writer = pd.ExcelWriter("pandas_column_formats.xlsx", engine='xlsxwriter')

In [259]:
# Turn off the default header and skip one row to allow us to insert a
# user defined header.
df.to_excel(writer, sheet_name='Sheet1')

# Get the xlsxwriter workbook and worksheet objects.
workbook  = writer.book
worksheet = writer.sheets['Sheet1']

# Add a header format.
header_format = workbook.add_format({
    'bold': True,
    'text_wrap': True,
    'valign': 'center',
    'fg_color': '#e1e1e1',
    'border': 1})

# Write the column headers with the defined format.
for col_num, value in enumerate(df.columns.values):
    worksheet.write(0, col_num + 2, value, header_format)


num_format = workbook.add_format({'num_format': '# ##0'})
worksheet.set_column('C:F', 20, num_format)

writer.save()

In [260]:
df.columns.values

array(['Total Imponible', 'Cotización Voluntaria (APVI) asdsadasdasd',
       'Total A Pagar A AFP', 'Total A Pagar SC'], dtype=object)

## Multiple DataFrames to the same sheet

In [261]:
# Create some Pandas dataframes from some data.
df1 = pd.DataFrame({'Data': [11, 12, 13, 14]})
df2 = pd.DataFrame({'Data': [21, 22, 23, 24]})
df3 = pd.DataFrame({'Data': [31, 32, 33, 34]})
df4 = pd.DataFrame({'Data': [41, 42, 43, 44]})

In [262]:
df1

   Data
0    11
1    12
2    13
3    14

In [263]:
df2

   Data
0    21
1    22
2    23
3    24

In [264]:
df3

   Data
0    31
1    32
2    33
3    34

In [265]:
# Create a Pandas Excel writer using XlsxWriter as the engine.
writer = pd.ExcelWriter('pandas_multiple.xlsx', engine='xlsxwriter')

In [266]:
# Position the dataframes in the worksheet.
df1.to_excel(writer, sheet_name='Sheet1')  # Default position, cell A1.
df2.to_excel(writer, sheet_name='Sheet1', startcol=3)
df3.to_excel(writer, sheet_name='Sheet1', startrow=6)

In [267]:
# Write the dataframe without the header and index.
df4.to_excel(writer, sheet_name='Sheet1',
             startrow=7, startcol=4, header=False, index=False)

In [268]:
writer.save()

-----

# Swap index

In [269]:
df

         Total Imponible  Cotización Voluntaria (APVI) asdsadasdasd  \
bar one           809219                                     549943
    two           815015                                      50900
baz one           337284                                     774802
    two           882148                                      80603
foo one           553820                                     387206
    two           978074                                     661484
qux one           436596                                     500549
    two           395341                                     763924

         Total A Pagar A AFP  Total A Pagar SC
bar one               650968            570665
    two               689164            849354
baz one               333735            551373
    two               547112            155913
foo one               349719            173578
    two               911056            165162
qux one               810898            512850
    two               533588            701000

In [270]:
gb = df.groupby(level=0)

In [272]:
df_sum = gb.sum()

In [273]:
df_sum

,Total Imponible,Cotización Voluntaria (APVI) asdsadasdasd,Total A Pagar A AFP,Total A Pagar SC
bar,1624234,600843,1340132,1420019
baz,1219432,855405,880847,707286
foo,1531894,1048690,1260775,338740
qux,831937,1264473,1344486,1213850

In [274]:
df_sum.columns = pd.MultiIndex.from_product([['Mutual'], df_sum.columns])

In [279]:
df_sum.columns

MultiIndex([('Mutual',                           'Total Imponible'),
            ('Mutual', 'Cotización Voluntaria (APVI) asdsadasdasd'),
            ('Mutual',                       'Total A Pagar A AFP'),
            ('Mutual',                          'Total A Pagar SC')],
           )

In [276]:
df_sum.index

Index(['bar', 'baz', 'foo', 'qux'], dtype='object')

In [284]:
df_sum.reset_index()

  index          Mutual                                            \
        Total Imponible Cotización Voluntaria (APVI) asdsadasdasd
0   bar         1624234                                    600843
1   baz         1219432                                    855405
2   foo         1531894                                   1048690
3   qux          831937                                   1264473


  Total A Pagar A AFP Total A Pagar SC
0             1340132          1420019
1              880847           707286
2             1260775           338740
3             1344486          1213850

In [281]:
writer = pd.ExcelWriter('testing_mutual.xlsx', engine='xlsxwriter')
# Turn off the default header and skip one row to allow us to insert a
# user defined header.
df_sum.to_excel(writer, sheet_name='Sheet1', index=False)

# Get the xlsxwriter workbook and worksheet objects.
workbook  = writer.book
worksheet = writer.sheets['Sheet1']

# Add a header format.
header_format = workbook.add_format({
    'bold': True,
    'text_wrap': True,
    'valign': 'center',
    'fg_color': '#e1e1e1',
    'border': 1})

#worksheet.set_column('A:D', None, header_format)


# Write the column headers with the defined format.
for col_num, value in enumerate(df_sum.columns.values):
    worksheet.write(1, col_num + 1, value[1], header_format)


num_format = workbook.add_format({'num_format': '# ##0'})
worksheet.set_column('A:D', 20, num_format)

writer.save()

NotImplementedError: Writing to Excel with MultiIndex columns and no index ('index'=False) is not yet implemented.